In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.0.5'

In [3]:
list_s = [1,2,-3,6.2,'data values']
print(list_s)

[1, 2, -3, 6.2, 'data values']

In [4]:
series1 = pd.Series(list_s)
print(series1)

0              1
1              2
2             -3
3            6.2
4    data values
dtype: object

In [5]:
type(series1)

pandas.core.series.Series

In [6]:
series2 = pd.Series([1,2,3,4])
print(series2)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
empty_s = pd.Series([])
print(empty_s)

Series([], dtype: float64)

G:\anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [8]:
series3 = pd.Series([1,2,3,4], index = ['a','b','c','d'])
print(series3)

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
series3 = pd.Series([1,2,3,4], index = ['a','b','c','d'], dtype = float)
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [10]:
series3 = pd.Series([1,2,3,4], index = ['a','b','c','d'], dtype = float, name = 'data values')
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
Name: data values, dtype: float64

In [11]:
scalar_s = pd.Series(0.5)
print(scalar_s)

0    0.5
dtype: float64

In [12]:
scalar_s = pd.Series(0.5, index = [1,2,3])
print(scalar_s)

1    0.5
2    0.5
3    0.5
dtype: float64

In [13]:
dict_s = pd.Series({'a':1, 'b':2})
print(dict_s)

a    1
b    2
dtype: int64

In [14]:
s4 = pd.Series([1,2,3,4,5])
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
s4[0]

1

In [16]:
s4[3]

4

In [17]:
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [18]:
max(s4)

5

In [19]:
min(s4)

1

In [20]:
s4[s4 > 3]

3    4
4    5
dtype: int64

In [21]:
s4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
s5 = pd.Series([1,2,3,4,5])
print(s5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
s4 + s5

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [24]:
s6 = pd.Series([1,2,3])
print(s6)

0    1
1    2
2    3
dtype: int64

In [25]:
s5 + s6

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [26]:
emt_df = pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [27]:
lst = ['a', 'b', 'c']
print(lst)

['a', 'b', 'c']

In [28]:
df1 = pd.DataFrame(lst)
print(df1)

   0
0  a
1  b
2  c

In [29]:
df1

   0
0  a
1  b
2  c

In [30]:
ls_of_ls = [[1,2,3],[2,3,4],[4,5,6]]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [31]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [32]:
dict1 = {'ID':[11,22,33,44]}
dict1

{'ID': [11, 22, 33, 44]}

In [33]:
df3 = pd.DataFrame(dict1)
df3

   ID
0  11
1  22
2  33
3  44

In [34]:
dict1 = {'ID':[11,22,33,44],'SN':[1,2,3,4]}
dict1

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}

In [35]:
df3 = pd.DataFrame(dict1)
df3

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [36]:
ls_dict = [{'a':1, 'b':2},{'a':3, 'b':4}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [37]:
ls_dict = [{'a':1, 'b':2},{'a':3, 'b':4, 'c':5}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [38]:
dict_sr = {'Id': pd.Series([1,2,3]), 'SN': pd.Series([111,222,333])}
df6 = pd.DataFrame(dict_sr)
df6

   Id   SN
0   1  111
1   2  222
2   3  333

In [39]:
import pandas as pd

In [40]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: str = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.
    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

In [41]:
pd.read_csv('E:\\Machine learning\\Tenserflow\\tips.csv')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [42]:
import os

In [43]:
print(os.getcwd())

C:\Users\sunilverma\Pandas

In [44]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv')
df

,0,1,2,3,4,5,6,7
0,Rank,Title,Employees,Sector,Industry,Hqlocation,Revenues,Profits
1,1,Walmart,2300000,Retailing,General Merchandisers,"Bentonville, AR",485873,13643
2,2,Berkshire Hathaway,367700,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",223604,24074
3,3,Apple,116000,Technology,"Computers, Office Equipment","Cupertino, CA",215639,45687
4,4,Exxon Mobil,72700,Energy,Petroleum Refining,"Irving, TX",205004,7840
...,...,...,...,...,...,...,...,...
496,496,Michaels Cos.,31000,Retailing,Specialty Retailers: Other,"Irving, TX",5197,378.2
497,497,Toll Brothers,4200,Engineering & Construction,Homebuilders,"Horsham, PA",5170,382.1
498,498,Yahoo,8500,Technology,Internet Services and Retailing,"Sunnyvale, CA",5169,-214.3
499,499,Vistra Energy,4431,Energy,Energy,"Dallas, TX",5164,-214.3
500,500,ABM Industries,110000,Business Services,Diversified Outsourcing Services,"New York, NY",5145,57.2

In [45]:
type(df)

pandas.core.frame.DataFrame

In [46]:
df.columns

Index(['0', '1', '2', '3', '4', '5', '6', '7'], dtype='object')

In [47]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv',nrows = 1)
df

      0      1          2       3         4           5         6        7
0  Rank  Title  Employees  Sector  Industry  Hqlocation  Revenues  Profits

In [48]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv',nrows = 5)
df

,0,1,2,3,4,5,6,7
0,Rank,Title,Employees,Sector,Industry,Hqlocation,Revenues,Profits
1,1,Walmart,2300000,Retailing,General Merchandisers,"Bentonville, AR",485873,13643
2,2,Berkshire Hathaway,367700,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",223604,24074
3,3,Apple,116000,Technology,"Computers, Office Equipment","Cupertino, CA",215639,45687
4,4,Exxon Mobil,72700,Energy,Petroleum Refining,"Irving, TX",205004,7840

In [49]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv',usecols = [2,4,7])
df

             2                                         4        7
0    Employees                                  Industry  Profits
1      2300000                     General Merchandisers    13643
2       367700  Insurance: Property and Casualty (Stock)    24074
3       116000               Computers, Office Equipment    45687
4        72700                        Petroleum Refining     7840
..         ...                                       ...      ...
496      31000                Specialty Retailers: Other    378.2
497       4200                              Homebuilders    382.1
498       8500           Internet Services and Retailing   -214.3
499       4431                                    Energy   -214.3
500     110000          Diversified Outsourcing Services     57.2

[501 rows x 3 columns]

In [50]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv',skiprows = [497])
df

,0,1,2,3,4,5,6,7
0,Rank,Title,Employees,Sector,Industry,Hqlocation,Revenues,Profits
1,1,Walmart,2300000,Retailing,General Merchandisers,"Bentonville, AR",485873,13643
2,2,Berkshire Hathaway,367700,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",223604,24074
3,3,Apple,116000,Technology,"Computers, Office Equipment","Cupertino, CA",215639,45687
4,4,Exxon Mobil,72700,Energy,Petroleum Refining,"Irving, TX",205004,7840
...,...,...,...,...,...,...,...,...
495,495,Big Lots,23150,Retailing,Specialty Retailers: Other,"Columbus, OH",5200,152.8
496,497,Toll Brothers,4200,Engineering & Construction,Homebuilders,"Horsham, PA",5170,382.1
497,498,Yahoo,8500,Technology,Internet Services and Retailing,"Sunnyvale, CA",5169,-214.3
498,499,Vistra Energy,4431,Energy,Energy,"Dallas, TX",5164,-214.3
499,500,ABM Industries,110000,Business Services,Diversified Outsourcing Services,"New York, NY",5145,57.2

In [51]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv', skiprows = 2)
df

,1,Walmart,2300000,Retailing,General Merchandisers,"Bentonville, AR",485873,13643
0,2,Berkshire Hathaway,367700,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",223604,24074.0
1,3,Apple,116000,Technology,"Computers, Office Equipment","Cupertino, CA",215639,45687.0
2,4,Exxon Mobil,72700,Energy,Petroleum Refining,"Irving, TX",205004,7840.0
3,5,McKesson,68000,Wholesalers,Wholesalers: Health Care,"San Francisco, CA",192487,2258.0
4,6,UnitedHealth Group,230000,Health Care,Health Care: Insurance and Managed Care,"Minnetonka, MN",184840,7017.0
...,...,...,...,...,...,...,...,...
494,496,Michaels Cos.,31000,Retailing,Specialty Retailers: Other,"Irving, TX",5197,378.2
495,497,Toll Brothers,4200,Engineering & Construction,Homebuilders,"Horsham, PA",5170,382.1
496,498,Yahoo,8500,Technology,Internet Services and Retailing,"Sunnyvale, CA",5169,-214.3
497,499,Vistra Energy,4431,Energy,Energy,"Dallas, TX",5164,-214.3
498,500,ABM Industries,110000,Business Services,Diversified Outsourcing Services,"New York, NY",5145,57.2

In [52]:
df = pd.read_csv('E:\\Machine learning\\Tenserflow\\fortune12.csv', skiprows = 4)
df

,3,Apple,116000,Technology,"Computers, Office Equipment","Cupertino, CA",215639,45687
0,4,Exxon Mobil,72700,Energy,Petroleum Refining,"Irving, TX",205004,7840.0
1,5,McKesson,68000,Wholesalers,Wholesalers: Health Care,"San Francisco, CA",192487,2258.0
2,6,UnitedHealth Group,230000,Health Care,Health Care: Insurance and Managed Care,"Minnetonka, MN",184840,7017.0
3,7,CVS Health,204000,Health Care,Health Care: Pharmacy and Other Services,"Woonsocket, RI",177526,5317.0
4,8,General Motors,225000,Motor Vehicles & Parts,Motor Vehicles and Parts,"Detroit, MI",166380,9427.0
...,...,...,...,...,...,...,...,...
492,496,Michaels Cos.,31000,Retailing,Specialty Retailers: Other,"Irving, TX",5197,378.2
493,497,Toll Brothers,4200,Engineering & Construction,Homebuilders,"Horsham, PA",5170,382.1
494,498,Yahoo,8500,Technology,Internet Services and Retailing,"Sunnyvale, CA",5169,-214.3
495,499,Vistra Energy,4431,Energy,Energy,"Dallas, TX",5164,-214.3
496,500,ABM Industries,110000,Business Services,Diversified Outsourcing Services,"New York, NY",5145,57.2

In [53]:
sr = pd.Series([1,2,3,np.nan,4,np.NAN])
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [54]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [55]:
sr.isnull().sum()

2